"use client";
import React, { useState } from "react";
import Image from "next/image";
import cover from "../../Public/images/covermadona.jpg";
import turkey from "../../Public/images/trk.png";
import mo1 from "../../Public/images/madona1.jpg";
import mo2 from "../../Public/images/موقع-14.jpg";
import mo3 from "../../Public/images/modona2.jpg";
import mo4 from "../../Public/images/موقع-15.jpg";
import mo5 from "../../Public/images/موقع-16.jpg";
import mo6 from "../../Public/images/modona8.jpg";
import mo7 from "../../Public/images/modona4.jpg";
import mo8 from "../../Public/images/modona5.jpg";
import mo9 from "../../Public/images/modona6.jpg";
import mo10 from "../../Public/images/modona7.jpg";
import mo11 from "../../Public/images/modona3.jpg";
import { useTranslation } from "react-i18next";

// مكون الكارد الفردي
const Card = ({ title, description, image, onClick }) => {
  return (
    <div
      className="relative shadow-2xl border-r-fuchsia-700 border-l-fuchsia-700 border-b-fuchsia-700 border-t-fuchsia-700  rounded-2xl  border p-4 w-96 h-72 flex flex-wrap  cursor-pointer transition-transform  hover:scale-105"
      onClick={onClick}
    >
      <div className="w-full h-32 relative mb-2">
        <Image
          src={image}
          alt={title}
          layout="fill"
          objectFit="cover"
          className="rounded-lg"
        />
      </div>
      <h2 className="text-xl text-[#7a0066c6] font-bold mx-auto text-center">
        {title}
      </h2>
    </div>
  );
};

// المكون الرئيسي
const Madonatna = () => {
  const [expandedCard, setExpandedCard] = useState(null);
  const { t, i18n } = useTranslation();
  const currentLang = i18n.language || "ar";
 
  const cardsData = [
    {
      title: t("كيف تبدأ رحلتك الدراسية في تركيا؟"),
      description: t(
        "Deva Education تقدم لك هذا الدليل الشامل لمساعدتك على بدء رحلتك الدراسية في تركيا بخطوات بسيطة ومضمونة"
      ),
      extraText1: t("✅اختيار التخصص والجامعة"),
      extraText2: t(
        "حدد أهدافك الدراسية: نحن في Deva Education نساعدك في اختيار التخصص الذي يناسب طموحاتك والبحث عن الجامعات المناسبة ايضاّ بفضل شراكاتنا مع العديد من الجامعات التركية المرموقة، نوفر لك استشارات مخصصة لاختيار الجامعة المناسبة"
      ),
      extraText3: t("✅التأكد من المتطلبات الأكاديمية"),
      extraText4: t(
        "سنرشدك لتجهيز جميع الوثائق الأكاديمية المطلوبة والتأكد من توافقها مع متطلبات الجامعات واختبارات القبول نقدم لك دعمًا خاصًا في التحضير لاختبارات القبول (YÖS، SAT) أو اختبارات اللغة (TOEFL، IELTS، TÖMER)"
      ),
      extraText5: t("✅ إعداد الوثائق المطلوبة"),
      extraText6: t(
        "فريقنا في Deva Education يساعدك في ترجمة وتصديق الوثائق وإعداد خطاب الدافع بشكل احترافي وتجهيز السيرة الذاتية ورسائل التوصية إذا لزم الأمر"
      ),

      image: turkey,
    },
    {
      title: t("أفضل الجامعات التركية وتخصصاتها المميزة؟"),
      description: t(
        "تركيا تضم عددًا كبيرًا من الجامعات  التي تقدم برامج تعليمية متميزة بمستويات عالمية، وتُعدُّ خيارًا مفضلاً للطلاب الدوليين والمحليين نظرًا لجودة التعليم والبنية التحتية الحديثة   واليك بعض الجامعات "
      ),

      extraText1: t("✅ جامعة بيلكنت"),
      extraText2: t(
        "تقع في أنقرة وتتميز الجامعه بتخصصات الهندسة والفنون والتصميم وادارة الاعمال وعلوم الحاسب "
      ),
      extraText3: t("✅جامعة بهتشة شهير"),
      extraText4: t(
        "تقع في أسطنبول وتتميز الجامعة بتخصصات الطب والهندسة والقانون والاعلام والفنون الجميلة والعديد من التخصصات الاخري"
      ),
      extraText5: t("✅جامعة إسطنبول بيلجي"),
      extraText6: t(
        "تقع الجامعه في اسطنبول وتتميز الجامعة بتخصصات الاعلام وادارة الاعمال والقانون والعلاقات الدولية والعديد من التخصصات الاخري المميزة"
      ),
      image: mo1,
    },
    {
      title: t("الحياة الثقافية والاجتماعية للطلاب الدوليين في تركيا ؟"),
      description: t(
        "Deva Education تُساعد الطلاب الدوليين على الاندماج والاستفادة من التجربة الثقافية والاجتماعية في تركيا من خلال تقديم خدمات شاملة تهدف إلى جعل حياتهم في تركيا أكثر سهولة وغنى"
      ),

      extraText1: t("✅ التكيف الثقافي"),
      extraText2: t(
        "تُوفّر Deva Education برامج تعريفية تهدف إلى تعريف الطلاب الدوليين بالثقافة التركية والتقاليد المحلية"
      ),
      extraText3: t("✅ الدعم الاجتماعي"),
      extraText4: t(
        "Deva Education تقوم بتقديم استشارات ودعم للطلاب للتعامل مع التحديات الاجتماعية والثقافية"
      ),
      extraText5: t("✅ الدعم في المعيشة اليومية"),
      extraText6: t(
        "Deva Education تساعد الطلاب في العثور على السكن المناسب، سواء داخل السكن الجامعي أو خارجه وتقوم بتقديم نصائح حول أفضل الخيارات للمواصلات، الطعام، والخدمات اليومية وتوفر لك كارت موصلات مجاني وهو احد مميزات Deva"
      ),
      image: mo2,
    },
    {
      title: t("فرص العمل أثناء وبعد الدراسة في تركيا"),
      description: t(
        "تركيا تُعد وجهة تعليمية مميزة للطلاب الدوليين، وتوفّر فرص عمل متنوعة أثناء الدراسة وبعد التخرج"
      ),

      extraText1: t("✅ أولاً: العمل أثناء الدراسة"),
      extraText2: t(
        "يُسمح للطلاب الدوليين في الجامعات التركية بالعمل بدوام جزئي وفقاً للقوانين التركية ويحتاج الطالب إلى تصريح عمل رسمي إذا كان مسجلاً في برنامج دراسات عليا (ماجستير أو دكتوراه) وطلاب برامج البكالوريوس يُسمح لهم بالعمل، لكن التراخيص تعتمد على حالة الطالب ونوع الجامعة ويُسمح للطلاب بالعمل حتى 24 ساعة أسبوعياً، بحيث لا يتعارض العمل مع أوقات الدراسة"
      ),

      extraText3: t("✅ ثانياً: العمل بعد التخرج"),
      extraText4: t(
        "بعد إنهاء الدراسة، يمكن للطلاب الدوليين التقدم بطلب للحصول على تصريح إقامة مؤقتة للبحث عن عمل في تركيا وعند العثور على وظيفة، تقوم الشركة التي توظف الخريج بتقديم طلب تصريح عمل نيابة عنه"
      ),

      extraText5: t("✅ القطاعات الأكثر طلباً للخريجين الدوليين"),
      extraText6: t(
        "التكنولوجيا وعلوم الحاسوب: شركات البرمجة والتكنولوجيا تحتاج إلى متخصصين"
      ),
      extraText7: t(
        "الهندسة: مجالات الهندسة المدنية، الميكانيكية، والكهربائية مطلوبة بشدة"
      ),
      extraText8: t(
        "التعليم: الخريجون الدوليون يُمكنهم العمل كمدرّسين للغات أو في المدارس الدولية"
      ),
      extraText9: t(
        "السياحة والضيافة: القطاع السياحي في تركيا من أكبر القطاعات التي توفر فرص عمل"
      ),
      extraText10: t(
        "التجارة الدولية: بفضل موقع تركيا الإستراتيجي، هناك طلب على المتخصصين في الاستيراد والتصدير"
      ),

      image: mo3,
    },
    {
      title: t("أهم النصائح للطلاب الجدد في تركيا"),
      description: t(
        "إذا كنت طالبًا دوليًا جديدًا في تركيا، فإن Deva Education ستساعدك في التكيف مع حياتك الدراسية والاجتماعية في تركيا بشكل أكثر سلاسة ونجاح. إليك كيفية استفادتك من خدمات Deva Education في كل جانب من جوانب حياتك الطلابية في تركيا"
      ),

      extraText1: t("✅ تعلم اللغة التركية"),
      extraText2: t(
        "يمكنك الانضمام إلى دورات تعلم اللغة التركية قبل وصولك أو أثناء دراستك، مما يعزز من قدرتك على التواصل بفعالية"
      ),

      extraText3: t("✅ التكيف مع الطعام التركي"),
      extraText4: t(
        "تقدم Deva Education نصائح للطلاب حول المأكولات التركية الأكثر شهرة وأماكن تناول الطعام المحلية التي تُناسب مختلف الأذواق ويساعدك الفريق في التعرف على خيارات الطعام المناسبة للطلاب الدوليين مثل مطاعم تقدم المأكولات العالمية أو الخيارات النباتية"
      ),

      extraText5: t("✅ إدارة الميزانية والتكاليف"),
      extraText6: t(
        "Deva Education تقدم إرشادات حول كيفية إدارة ميزانيتك الشهرية، بما في ذلك نصائح حول التكاليف المتوقعة للسكن والطعام وتساعدك أيضًا في الاستفادة من العروض والخصومات التي تقدمها الجامعات أو الخدمات المحلية"
      ),

      image: mo4,
    },

    {
      title: t("لماذا تعتبر تركيا وجهة مفضلة للدراسة؟"),
      description: t(
        "إذا كنت تفكر في الدراسة في تركيا، Deva Education تقدم لك الدعم الكامل لتجعل من تجربتك الدراسية في هذا البلد الرائع تجربة ناجحة وثرية. إليك لماذا تركيا هي وجهة مفضلة للدراسة وكيف يمكن لـ Deva Education أن تكون شريكك المثالي في رحلتك الأكاديمية"
      ),
      extraText1: t("✅ التعليم العالي ذو الجودة"),
      extraText2: t(
        "Deva Education تساهم في إرشادك لاختيار الجامعات التركية المعترف بها دوليًا والتي تقدم برامج أكاديمية ذات جودة عالية. سواء كنت تبحث عن دراسة في الهندسة، الطب، العلوم الاجتماعية أو أي مجال آخر، Deva Education توفر لك المعلومات اللازمة لاختيار البرنامج الأنسب لك"
      ),
      extraText3: t("✅ بيئة طلابية نشطة"),
      extraText4: t(
        "Deva Education تقدم لك الفرص للمشاركة في الأنشطة الطلابية والفعاليات الجامعية. من خلال تنظيم لقاءات اجتماعية، ورش عمل، ومؤتمرات ثقافية، ستتمكن من بناء شبكة علاقات قوية مع زملائك من جميع أنحاء العالم"
      ),
      extraText5: t("✅ دعم الحكومة التركية للطلاب الدوليين"),
      extraText6: t(
        "من خلال Deva Education، ستحصل على الإرشاد بشأن المنح الدراسية التي تقدمها الحكومة التركية، مثل منحة تركيا، والتي يمكن أن تغطي الرسوم الدراسية والإقامة. كما أن Deva Education توفر لك مساعدة في التقديم للحصول على تأشيرة الإقامة الدراسية في تركيا"
      ),
      image: mo5,
    },

    {
      title: t("كيف تستفيد من خبرتك الدراسية في تركيا لبناء مستقبلك المهني؟"),
      description: t(
        "الدراسة في تركيا ليست فقط فرصة للحصول على تعليم عالي الجودة، بل هي أيضًا بوابة لبناء مستقبل مهني ناجح. إليك مجموعة من النصائح حول كيفية الاستفادة من خبرتك الدراسية في تركيا لتحقيق أهدافك المهنية، مع دعم من Deva Education لضمان نجاحك"
      ),
      extraText1: t("✅ بناء شبكة علاقات مهنية"),
      extraText2: t(
        "استغل الفرص للتواصل مع زملائك، الأساتذة، والخريجين. تركيا بلد يعج بالمؤتمرات والفعاليات الأكاديمية التي تتيح لك التعرف على شخصيات مؤثرة في مجالك والجامعات التركية، خاصة الخاصة منها، تنظم العديد من المؤتمرات والشراكات مع شركات عالمية وDeva Education تساعدك في الوصول إلى هذه الفرص وربطك بأهم شبكات الأعمال في تركيا"
      ),
      extraText3: t("✅ تطوير مهاراتك العملية"),
      extraText4: t(
        "لبرامج التدريبية: استفد من الفرص التدريبية (Internships) التي تقدمها الجامعات التركية بالتعاون مع الشركات المحلية والدولية"
      ),
      extraText5: t("✅ فهم سوق العمل التركي"),
      extraText6: t(
        "البحث عن التخصصات المطلوبة: تركيا تشهد نموًا في قطاعات مثل الهندسة، التكنولوجيا، السياحة، والتجارة الدولية. اختيارك لتخصص مرتبط بسوق العمل يمنحك ميزة تنافسية واحرص على الاطلاع على احتياجات السوق من خلال المعارض الوظيفية أو الاستشارات المهنية التي تنظمها الجامعات"
      ),
      image: mo6,
    },

    {
      title: t("كيف تختار الجامعة الأنسب لك في تركيا؟"),
      description: t(
        "اختيار الجامعة الأنسب لك في تركيا هو قرار مهم يؤثر على تجربتك الأكاديمية ومستقبلك المهني Deva Education تقدم لك إرشادات شاملة لمساعدتك في اتخاذ القرار الصائب"
      ),
      extraText1: t("✅ تحديد أهدافك الأكاديمية والمهنية"),
      extraText2: t(
        "حدد التخصص الذي ترغب في دراسته بناءً على اهتماماتك وقدراتك وخططك المستقبلية إذا كنت تخطط للعمل في بيئة دولية، فقد تكون الجامعات التي تقدم برامج باللغة الإنجليزية هي الخيار الأفضل"
      ),
      extraText3: t("✅ التحقق من جودة الجامعة"),
      extraText4: t(
        "تأكد من أن الجامعة معترف بها دوليًا ولديها اعتماد قوي واقرأ آراء الطلاب الحاليين والخريجين حول تجربتهم في الجامعة"
      ),
      extraText5: t("✅ استشارة المتخصصين"),
      extraText6: t(
        "إذا كنت محتارًا بين عدة خيارات، يمكن لـ Deva Education مساعدتك في اختيار الجامعة الأنسب بناءً على تخصصك وميزانيتك والتقديم على الجامعات والمنح الدراسية وحصول على معلومات دقيقة حول الحياة الدراسية في تركيا"
      ),
      image: mo7,
    },

    {
      title: t("برامج الماجستير والدكتوراه في تركيا"),
      description: t(
        "برامج الماجستير والدكتوراه في تركيا تُعتبر من الخيارات الرائدة للطلاب الدوليين الذين يسعون للحصول على تعليم عالي الجودة في بيئة تعليمية غنية بالثقافة والابتكار. تقدم الجامعات التركية برامج متنوعة باللغتين التركية والإنجليزية، مع تركيز قوي على البحث والتطوير. هنا نظرة شاملة على برامج الماجستير والدكتوراه في تركيا، وكيف يمكن لـ Deva Education مساعدتك في اختيار الأنسب لك"
      ),
      extraText1: t("✅ مميزات دراسة الماجستير والدكتوراه في تركيا"),
      extraText2: t(
        "التعليم عالي الجودة وتقدم الجامعات التركية برامج معتمدة عالميًا ومتوافقة مع نظام بولونيا الأوروبي وتوفر الجامعات الحديثة مراكز بحثية ومختبرات مجهزة بأحدث التقنيات"
      ),
      extraText3: t("✅ هيكل برامج الماجستير والدكتوراه"),
      extraText4: t(
        "مده الماجستير تستغرق عادةً من 1.5 إلى 2 سنة وانواع البرامج نوعين الماجستير الأكاديمي (مع رسالة): موجه للطلاب الذين يهدفون للبحث الأكاديمي أو متابعة الدكتوراه والنوع الثاني الماجستير المهني (بدون رسالة): مخصص للطلاب الراغبين في تطوير مهارات عملية"
      ),
      extraText5: t("✅ أفضل الجامعات التركية للدراسات العليا"),
      extraText6: t(
        "جامعة بيلكنت: تركز على البحث والابتكار في مجالات التكنولوجيا والهندسة"
      ),
      extraText8: t(
        "جامعة التن باش معروفة ببرامج الدراسات العليا المتقدمة في العلوم الإدارية والهندسة والعديد من الجامعات الاخري"
      ),
      image: mo8,
    },
    {
      title: t("السكن الطلابي في تركيا"),
      description: t(
        "السكن الطلابي في تركيا هو أحد العوامل المهمة التي تساهم في توفير بيئة مريحة وآمنة للطلاب الدوليين خلال فترة دراستهم. يختلف نوع السكن بناءً على المدينة، الجامعة، والميزانية. Deva Education تقدم لك دليلًا شاملًا لمساعدتك في اختيار السكن المناسب"
      ),
      extraText1: t("✅ السكن الجامعي"),
      extraText2: t(
        "مساكن يديرها حرم الجامعة وتكون مخصصة للطلاب وتتميز بأنها قريبة من الجامعة، مما يوفر وقتًا وجهدًا في التنقل وتكلفة معقولة مقارنة بالخيار الخاص وعيوبها قد تكون الغرف صغيرة ومشاركة المرافق أمرًا شائعًا"
      ),
      extraText3: t("✅ السكن الحكومي (KYK)"),
      extraText4: t(
        "تديره الحكومة التركية، ويوفر خيارات ميسورة التكلفة للطلاب ويتميز برسومه المنخفضة للغاية وتقديم وجبات يومية ضمن التكلفة وعيوبها قيود على الأنشطة اليومية (مثل أوقات الدخول والخروج)"
      ),
      extraText5: t("✅ السكن الخاص"),
      extraText6: t(
        "مساكن تديرها شركات خاصة ويتميز بغرف متنوعة (مفردة، مزدوجة، أو مشتركة) وخدمات إضافية مثل التنظيف، الإنترنت، والوجبات وعيوبه هي التكلفة العالية مقارنة بغيرها"
      ),
      image: mo9,
    },

    {
      title: t("أفضل المدن التركية للطلاب الدوليين"),
      description: t(
        "تركيا تُعد واحدة من أفضل الوجهات التعليمية للطلاب الدوليين، حيث توفر جامعات مرموقة، تكاليف معيشة معقولة، وبيئة ثقافية متنوعة. عند اختيار مدينة للدراسة، يجب مراعاة جودة التعليم، تكاليف المعيشة، فرص العمل، والأنشطة الطلابية."
      ),
      extraText1: t("✅ إسطنبول 🏙️"),
      extraText2: t(
        "إسطنبول هي أكبر مدينة في تركيا، وتضم أفضل الجامعات والمراكز الثقافية، مما يجعلها الوجهة الأولى للطلاب الدوليين وتتميز المدينة بوجود أكبر عدد من الجامعات المرموقة وفرص تدريب وعمل واسعة وحياة ثقافية واجتماعية غنية وتدتها تكون في تكلفة المعيشة مرتفعة مقارنةً بمدن أخرى"
      ),
      extraText3: t("✅ أنقرة 🏛️"),
      extraText4: t(
        "أنقرة، عاصمة تركيا، تُعد مركزًا أكاديميًا مهمًا، حيث تضم جامعات حكومية قوية وتكاليف معيشة أقل من إسطنبول وتتميز بتكلفة معيشة أقل من إسطنبول ومواصلات منظمة وسهلة وبيئة أكاديمية قوية وتكمن تديتها في الطقس بارد في الشتاء"
      ),
      extraText5: t("✅ أنطاليا 🏖️"),
      extraText6: t(
        "مدينة سياحية رائعة توفر جودة حياة عالية وشواطئ خلابة وتتميز في مناخ رائع وشواطئ جميلة وبيئة طلابية نشطة وتكون تديتها في الوظائف المحدودة خارج السياحة"
      ),
      image: mo10,
    },
    {
      title: t("أفضل التخصصات الطبية والهندسية في تركيا"),
      description: t(
        "تركيا تُعد واحدة من أفضل الدول لدراسة التخصصات الطبية والهندسية، حيث تضم جامعات مرموقة، ومناهج تعليمية متقدمة، وفرص عمل ممتازة بعد التخرج. إليك دليل شامل لأفضل التخصصات في المجالين، مع دعم Deva Education لمساعدتك في اختيار الأفضل لك"
      ),
      extraText1: t(" ✅ أولًا: التخصصات الطبية في تركيا 🏥"),
      extraText2: t(
        "تركيا توفر نظامًا تعليميًا طبيًا متميزًا، حيث يتم تدريس التخصصات الطبية وفق أحدث المعايير العالمية، مع توفر فرص تدريب عملية في المستشفيات الكبرى ونبدأ ب الطب البشري ومده دراسته 6سنوات ويدرس باللغة التركية والانجليزية ويتميز بمستوي التعليم العالي والمناهج الحديثة وامكانية التخصص بعد التخرج في مختلف الفروع"
      ),
      extraText12: t(
        "الصيدلة ومده الدراسة5 سنوات وتتميز بفرص عمل في المستشفيات وشركات الأدوية ورواتب جيدة بعد التخرج"
      ),
      extraText13: t(
        "العلاج الطبيعي والتأهيل ومدة دراستة 4سنوات ويتميز بذدياد طلبه عالميا وبيئه عمله المريحة"
      ),
      extraText3: t("✅ التخصصات الهندسية في تركيا 🏗️"),
      extraText4: t(
        "تُعد تركيا واحدة من أفضل الدول لدراسة الهندسة، حيث توفر الجامعات برامج قوية مع معامل حديثة وشراكات مع شركات كبرى  واهم التخصصات الهندسة الطبية الحيوية ومده الدراسة 4سنوات وكذلك هندسة الكمبيوتر رواتبها مرتفعة وفرص العمل بها عاليه دا والهندسة الميكانيكية والكهربائية والمدنية"
      ),
      image: mo11,
    },
  ];

  return (
    <>
      <Image
        src={cover}
        className=" h-[80vh]  md:w-full max-sm:pt-16 max-sm:h-[70vh] max-lg:min-w-[80rem] max-sm:max-w-[80rem] pt-16  max-sm:object-cover"
      />
    
      <h1
        className={`mx-auto font-bold px-6  max-lg:text-center  rounded-2xl my-10  mt-6  py-6   text-3xl  tracking-wide mb-8 rounded-tl-2xl border border-dashed  border-r-red-900 border-l-red-900 border-b-fuchsia-700 border-t-fuchsia-700 rounded-br-2xl text-center items-center max-lg:w-[40rem] max-lg:mr-80 text-[#7A0066CB] bg-[#eed1e8] w-2/4 p-2
  ${i18n.language === "ru" ? "text-2xl" : "text-3xl"}`}
      >
        {" "}
        {t("وجهتك الأولى لكل ما تحتاجه عن الدراسة والحياة الطلابية في تركيا")}
      </h1>

      {expandedCard !== null && (
        <div
          className="fixed inset-0 bg-black/30  backdrop-blur-sm flex items-center justify-center z-50 mt-20 min-w-full max-sm:w-[70rem]  max-sm:-mr-[50rem] max-lg:-mr-[32rem] md:w-[70rem] lg:w-[75rem]"
          onClick={() => setExpandedCard(null)}
        >
 <div className="relative backdrop-blur-xl bg-white/80 shadow-2xl rounded-2xl p-8 w-[65%] max-lg:w-[75rem] h-[80vh] overflow-y-auto scrollbar-hidden">

  <div className="w-full h-48 relative mb-6 rounded-lg overflow-hidden shadow-lg">
    <Image
      src={cardsData[expandedCard].image}
      alt={cardsData[expandedCard].title}
      layout="fill"
      objectFit="cover"
      className="rounded-lg"
    />
  </div>

  {/* العنوان الرئيسي */}
  <h2 className="text-4xl font-extrabold text-fuchsia-800 text-center mb-4 drop-shadow-lg">
    {cardsData[expandedCard].title}
  </h2>

  {/* الوصف الأساسي */}
  <p className="text-center text-lg text-gray-700 font-medium leading-relaxed mb-6 px-4">
    {cardsData[expandedCard].description}
  </p>

  {/* المحتوى الإضافي مُنظم بشكل أفضل */}
  <div className="grid gap-4 text-gray-600">
    {[
      { label: cardsData[expandedCard].extraText1, content: cardsData[expandedCard].extraText2 },
      { label: cardsData[expandedCard].extraText3, content: cardsData[expandedCard].extraText4 },
      { label: cardsData[expandedCard].extraText5, content: cardsData[expandedCard].extraText6 },
    ].map((item, index) => (
      <div key={index} className="bg-gray-100/70 p-4 rounded-lg shadow-md">
        <p className="font-semibold text-gray-900">{item.label}</p>
        <p className="text-gray-600">{item.content}</p>
      </div>
    ))}
  </div>
</div>

        </div>
      )}


      <div className="grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 lg:grid-cols-3 gap-8 p-10 max-lg:w-[79rem] max-sm:pr-52 max-lg:grid-cols-2">
        {cardsData.map((card, index) => (
          <Card
            key={index}
            title={card.title}
            description={card.description}
            image={card.image}
            onClick={() => setExpandedCard(index)}
          />
        ))}
      </div>
    </>
  );
};

export default Madonatna;
